# SquareMetersPerKilowatt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..SquareMetersPerKilowatt Property
UnitTypeId Class See Also
---
Square meters per kilowatt.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SquareMetersPerKilowatt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SquareMetersPerKilowatt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SquareMetersPerKilowatt {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace